palmes-en-cornouaille.fr/htdocs/app/Models/Public/Donnees.php

SELECT `i`.`path` as `image`, `ig`.`path` as `image_groupe`, `il`.`path` as `logoffessm`, `g`.`nomClub`, `g`.`mailClub`, `g`.`adresse`, `g`.`description`, `g`.`philosophie`, `g`.`nombreNageurs`, `g`.`projetSportif`, `g`.`lienFacebook`, `g`.`lienInstagram`, `g`.`lienffessm`, `g`.`lienDrive`, ROUND(g.nombreHommes / g.nombreNageurs * 100, 1) as pourcentH, ROUND((g.nombreNageurs - g.nombreHommes) / g.nombreNageurs * 100, 1) as pourcentF
FROM `general` `g`
LEFT JOIN `images` `i` ON `g`.`image_id` = `i`.`id`
LEFT JOIN `images` `ig` ON `g`.`image_groupe_id` = `ig`.`id`
LEFT JOIN `images` `il` ON `g`.`logoffessm_id` = `il`.`id`
---
    public function getGeneral()
    {
        $result = $this
            ->db
            ->table('general g')
            ->join('images i', 'g.image_id = i.id', 'left')
            ->join('images ig', 'g.image_groupe_id = ig.id', 'left')
            ->join('images il', 'g.logoffessm_id = il.id', 'left')
            ->select('i.path as image, ig.path as image_groupe, il.path as logoffessm')
            ->select('g.nomClub, g.mailClub, g.adresse, g.description, g.philosophie, g.nombreNageurs, g.projetSportif, g.lienFacebook, g.lienInstagram, g.lienffessm, g.lienDrive, g.campagne_active, g.lienFormulaire')
            ->select('ROUND(g.nombreHommes / g.nombreNageurs * 100, 1) as pourcentH')
            ->select('ROUND((g.nombreNageurs - g.nombreHommes) / g.nombreNageurs * 100, 1) as pourcentF')
            ->get()
            ->getRowArray()

SELECT `m`.`nom`, `i`.`path` as `photo`
FROM `membres` `m`
LEFT JOIN `images` `i` ON `m`.`image_id` = `i`.`id`
JOIN `membre_fonction` `mf` ON `m`.`id` = `mf`.`membre_id`
JOIN `fonctions` `f` ON `mf`.`fonction_id` = `f`.`id`
WHERE `f`.`titre` = 'Coach'
---
    public function getPresident()
    {
        $result = $this
            ->db
            ->table('membres m')
            ->join('images i', 'm.image_id = i.id', 'left')
            ->select('m.nom, i.path as photo')
            ->join('membre_fonction mf', 'm.id = mf.membre_id')
            ->join('fonctions f', 'mf.fonction_id = f.id', 'left')
            ->where('f.titre', 'Président')
            ->get()
            ->getRowArray()

SELECT `d`.`nom`, `d`.`description`, `i`.`path` as `image`
FROM `disciplines` `d`
LEFT JOIN `images` `i` ON `d`.`image_id` = `i`.`id`
---
    public function getDisciplines()
    {
        return $this
            ->db
            ->table('disciplines d')
            ->join('images i', 'd.image_id = i.id', 'left')
            ->select('d.nom, d.description, i.path as image')
            ->get()
            ->getResultArray()

SELECT `p`.`nom`, `p`.`adresse`, `p`.`type_bassin`, `i`.`path` as `photo`
FROM `piscines` `p`
LEFT JOIN `images` `i` ON `p`.`image_id` = `i`.`id`
---
    public function getPiscines()
    {
        return $this
            ->db
            ->table('piscines p')
            ->join('images i', 'p.image_id = i.id', 'left')
            ->select('p.nom, p.adresse, p.type_bassin, i.path as photo')
            ->get()
            ->getResultArray()

SELECT `m`.*, `i`.`path` as `photo`, GROUP_CONCAT(f.titre SEPARATOR ", ") AS fonctions
FROM `membres` `m`
LEFT JOIN `images` `i` ON `m`.`image_id` = `i`.`id`
JOIN `membre_fonction` `mf` ON `mf`.`membre_id` = `m`.`id`
JOIN `fonctions` `f` ON `f`.`id` = `mf`.`fonction_id`
WHERE `f`.`titre` != 'Coach'
AND `f`.`titre` != 'Coach en formation'
GROUP BY `m`.`id`
---
    public function getBureau()
    {
        return $this
            ->db
            ->table('membres m')
            ->join('images i', 'm.image_id = i.id', 'left')
            ->select('m.*, i.path as photo, GROUP_CONCAT(f.titre SEPARATOR ", ") AS fonctions')
            ->join('membre_fonction mf', 'mf.membre_id = m.id')
            ->join('fonctions f', 'f.id = mf.fonction_id')
            ->where('f.titre !=', 'Coach')
            ->where('f.titre !=', 'Coach en formation')
            ->groupBy('m.id')
            ->get()
            ->getResultArray()

SELECT `a`.`id`, `a`.`titre`, `a`.`slug`, `a`.`type`, `a`.`description`, `i`.`path` as `image`, `i`.`alt`, `a`.`date_evenement`, `a`.`created_at`, `m`.`nom` as `auteur`
FROM `actualites` `a`
LEFT JOIN `images` `i` ON `a`.`image_id` = `i`.`id`
JOIN `membres` `m` ON `a`.`id_auteur` = `m`.`id`
WHERE `a`.`statut` = 'publie'
AND `a`.`type` = 'actualite'
ORDER BY `a`.`created_at` DESC
---
    public function getActualites()
    {
        $actus = $this
            ->db
            ->table('actualites a')
            ->join('images i', 'a.image_id = i.id', 'left')
            ->join('membres m', 'a.id_auteur = m.id')
            ->select('a.id, a.titre, a.slug, a.type, a.description, i.path as image, i.alt, a.date_evenement, a.created_at, m.nom as auteur')
            ->where(['a.statut' => 'publie', 'a.type' => 'actualite'])
            ->orderBy('a.created_at', 'DESC')
            ->get()
            ->getResultArray()
        ;

        $today = date('Y-m-d');
        $actusFiltres = [];

        foreach ($actus as $actu) {
            if (!empty($actu['date_evenement']) && $actu['date_evenement'] < $today) {
                // On met à jour l'archivage uniquement si c'est une vraie donnée (id > 0)
                if (isset($actu['id']) && $actu['id'] > 0) {
                    $this
                        ->db
                        ->table('actualites')
                        ->where('id', $actu['id'])
                        ->update(['statut' => 'archive'])

SELECT `a`.`id`, `a`.`titre`, `a`.`slug`, `a`.`type`, `a`.`description`, `i`.`path` as `image`, `i`.`alt`, `a`.`date_evenement`, `a`.`created_at`, `m`.`nom` as `auteur`
FROM `actualites` `a`
LEFT JOIN `images` `i` ON `a`.`image_id` = `i`.`id`
JOIN `membres` `m` ON `a`.`id_auteur` = `m`.`id`
WHERE `a`.`statut` = 'publie'
AND `a`.`type` = 'actualite'
ORDER BY `a`.`created_at` DESC
---
    public function getUneActualites($slug)
    {
        return $this
            ->db
            ->table('actualites a')
            ->join('images i', 'a.image_id = i.id', 'left')
            ->select('a.titre, a.slug, a.type, a.description, i.path as image, i.alt, a.date_evenement, a.created_at, m.nom as auteur')
            ->join('membres m', 'a.id_auteur = m.id')
            ->where(['a.statut' => 'publie', 'a.slug' => $slug])
            ->get()
            ->getResultArray()

SELECT `m`.`nom`, `i`.`path` as `photo`
FROM `membres` `m`
LEFT JOIN `images` `i` ON `m`.`image_id` = `i`.`id`
JOIN `membre_fonction` `mf` ON `m`.`id` = `mf`.`membre_id`
JOIN `fonctions` `f` ON `mf`.`fonction_id` = `f`.`id`
WHERE `f`.`titre` = 'Coach'
---
    private function getMembresParFonction(string $titreFonction)
    {
        return $this
            ->db
            ->table('membres m')
            ->join('images i', 'm.image_id = i.id', 'left')
            ->select('m.nom, i.path as photo')
            ->join('membre_fonction mf', 'm.id = mf.membre_id')
            ->join('fonctions f', 'mf.fonction_id = f.id')
            ->where('f.titre', $titreFonction)
            ->orderBy('m.nom', 'ASC')
            ->get()
            ->getResultArray()