palmes-en-cornouaille.fr/htdocs/app/Models/Public/InscriptionModel.php

SELECT `m`.`nom`, `m`.`description`, `m`.`idPret`, `i`.`path` as `image`, `p`.`nom` as `nomPret`
FROM `materiel` `m`
LEFT JOIN `images` `i` ON `m`.`image_id` = `i`.`id`
LEFT JOIN `pret` `p` ON `p`.`id` = `m`.`idPret`
---
    public function getMateriel()
    {
        return $this
            ->db
            ->table('materiel m')
            ->join('images i', 'm.image_id = i.id', 'left')
            ->join('pret p', 'p.id = m.idPret', 'left')
            ->select('m.nom, m.description, m.idPret, i.path as image, p.nom as nomPret')
            ->get()
            ->getResultArray()