palmes-en-cornouaille.fr/htdocs/app/Models/Public/PartenaireModel.php

SELECT `partenaires`.`description`, `partenaires`.`ordre`, `images`.`path` as `image_url`
FROM `partenaires`
LEFT JOIN `images` ON `partenaires`.`image_id` = `images`.`id`
ORDER BY `partenaires`.`ordre` ASC
---
    public function getPartenaires()
    {
        return $this->select('partenaires.description, partenaires.ordre')
            ->select('images.path as image_url')
            ->join('images', 'partenaires.image_id = images.id', 'left')
            ->orderBy('partenaires.ordre', 'ASC')
            ->findAll()