palmes-en-cornouaille.fr/htdocs/app/Models/admin/ActualiteModel.php

    public function getActualitesWithRelations($id = null)
    {
        $builder = $this->select('actualites.*, images.path as image_path, images.alt, membres.nom as auteur_nom')
            ->join('images', 'actualites.image_id = images.id', 'left')
            ->join('membres', 'actualites.id_auteur = membres.id', 'left')
        ;

        if ($id) {
            return $builder->where('actualites.id', $id)->first();
        }

        return $builder->orderBy('actualites.created_at', 'DESC')->findAll();
---
SELECT `actualites`.*, `images`.`path` as `image_path`, `images`.`alt`, `membres`.`nom` as `auteur_nom`
FROM `actualites`
LEFT JOIN `images` ON `actualites`.`image_id` = `images`.`id`
LEFT JOIN `membres` ON `actualites`.`id_auteur` = `membres`.`id`
ORDER BY `actualites`.`created_at` DESC