palmes-en-cornouaille.fr/htdocs/app/Models/admin/CalendriersModel.php

SELECT `calendriers`.*, `images`.`path` as `image_path`, `images`.`alt`
FROM `calendriers`
LEFT JOIN `images` ON `calendriers`.`image_id` = `images`.`id`
ORDER BY `calendriers`.`categorie` ASC, `calendriers`.`id` DESC
---
    public function getCalendriersWithRelations($id = null)
    {
        $builder = $this
            ->select('calendriers.*, images.path as image_path, images.alt')
            ->join('images', 'calendriers.image_id = images.id', 'left')
        ;

        if ($id) {
            return $builder->where('calendriers.id', $id)->first();
        }

        // Tri par catégorie pour regrouper visuellement, puis par date (descendant) pour avoir les récents
        return $builder
            ->orderBy('calendriers.categorie', 'ASC')
            ->orderBy('calendriers.id', 'DESC')
            ->findAll()