palmes-en-cornouaille.fr/htdocs/app/Models/admin/PalmaresModel.php

SELECT `palmares`.*, `images`.`path` as `image_path`, `images`.`alt` as `image_alt`
FROM `palmares`
LEFT JOIN `images` ON `images`.`id` = `palmares`.`image_id`
ORDER BY `date_epreuve` DESC, `classement` ASC
---
    public function getPalmaresWithRelations($id = null)
    {
        $builder = $this->select('palmares.*, images.path as image_path, images.alt as image_alt, statut')
            ->join('images', 'images.id = palmares.image_id', 'left')
        ;

        if ($id) {
            return $builder->where('palmares.id', $id)->first();
        }

        return $builder->orderBy('date_epreuve', 'DESC')->orderBy('classement', 'ASC')->findAll();