palmes-en-cornouaille.fr/htdocs/app/Controllers/admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `actualites`
SELECT COUNT(*) AS `numrows` FROM `boutique`
SELECT COUNT(*) AS `numrows` FROM `membres`
SELECT COUNT(*) AS `numrows` FROM `groupes`
SELECT COUNT(*) AS `numrows` FROM `calendriers`
SELECT COUNT(*) AS `numrows` FROM `piscines`
SELECT COUNT(*) AS `numrows` FROM `partenaires`
SELECT COUNT(*) AS `numrows` FROM `materiel`
SELECT COUNT(*) AS `numrows` FROM `disciplines`
SELECT COUNT(*) AS `numrows` FROM `utilisateurs`
---
    public function index()
    {
        $data = $this->getCommonData('Dashboard - admin', 'admin/dashboard.css');

        // Récupération des compteurs via le modèle Donnees (ou des modèles spécifiques)
        // Note: count($this->donneesModel->get...) n'est pas très optimisé mais fonctionne pour l'instant.
        // Idéalement : $db->table('actualites')->countAll();

        $db = Database::connect();

        $data['count'] = [
            'path' => '/sectionAccueil.php',
            'actualites' => $db->table('actualites')->where('statut', 'publie')->countAll(),
            'boutique' => $db->table('boutique')->countAll(),
            'membres' => $db->table('membres')->countAll(),
            'groupes' => $db->table('groupes')->countAll(),
            'calendriers' => $db->table('calendriers')->countAll(),
            'piscines' => $db->table('piscines')->countAll(),
            'partenaires' => $db->table('partenaires')->countAll(),
            'materiel' => $db->table('materiel')->countAll(),
            'disciplines' => $db->table('disciplines')->countAll(),
            'utilisateurs' => $db->table('utilisateurs')->countAll(),