palmes-en-cornouaille.fr/htdocs/app/Controllers/admin/General.php

SELECT *
FROM `general`
 LIMIT 1
---
    public function update()
    {
        if (!$this->validate([
            'nomClub' => 'required|min_length[3]|max_length[100]',
            'mailClub' => 'permit_empty|valid_email',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $existing = $this->generalModel->first();

UPDATE `general` SET `nomClub` = 'Palmes en Cornouaille', `mailClub` = 'mathisfrances11@gmail.com', `adresse` = '47 Av. des Oiseaux, 29000 Quimper', `description` = 'Nous sommes ravis de vous accueillir sur le site officiel de notre club de natation basé à Quimper. Que vous soyez un nageur débutant ou expérimenté, notre club offre une variété de disciplines et d\'activités pour tous les âges et niveaux.', `philosophie` = 'La nage avec palmes apporte gainage et sensation de glisse incomparable.', `nombreNageurs` = '109', `nombreHommes` = '24', `projetSportif` = 'Découvrir la natation avec Palmes et pour certains accéder à un niveau important de compétition', `lienFormulaire` = '', `lienFacebook` = 'https://www.facebook.com/palmesencornouaille', `lienInstagram` = 'https://www.instagram.com/palmesencornouaille/', `lienffessm` = 'https://ffessm.fr/', `lienDrive` = 'https://drive.google.com/drive/folders/18GiIlRzP7rdLiQx8dArAoSjK9WJZDo3z?usp=drive_link', `lienDecatPro` = 'https://partnership.decathlonpro.fr/invitation/e09bce41-329d-4072-b8df-e591fc24e1a2'
WHERE `general`.`id` IN ('1')
---
        // On ne touche plus à 'image_id' pour le logo principal

        if ($id) {
            $this->generalModel->update($id, $data);